performance/reports/archive/runs/normal-day-2026-08-20T01-45-09/summary.txt
     ✓ login 200
     ✓ refresh 200
     ✓ board list 200
     ✓ user info 200
     ✓ post search 200
     ✓ hot daily 200
     ✓ my posts 200
     ✓ post detail 200
     ✓ comment create 2xx
     ✓ post list 200
     ✓ post create 2xx
     ✓ post update 200
     ✓ post delete 200
     ✓ unread count 200
     ✓ scrap 2xx
     ✓ chat rooms 200
     ✓ comment list 200
     ✓ friend list 200
     ✓ received reqs 200
     ✓ meal today 200
     ✓ chat messages 200
     ✓ notif list 200
     ✓ timetable today 200
     ✓ chat read 200
     ✓ read all 200
     ✓ post reaction 2xx
     ✓ ws handshake 101
     ✓ comment reaction 200
     ✓ read one 200
     ✓ logout 200
     ✓ meal month 200

     auth_token_refreshes...........: 25      0.040999/s
     chat_ws_messages_sent..........: 694     1.13813/s
     chat_ws_rtt....................: avg=3.34s   min=15ms     med=2.62s   max=14.11s   p(90)=7.48s   p(95)=9.1s     p(99)=12.12s  
     checks.........................: 100.00% ✓ 11130     ✗ 0    
     ✓ { phase:measure }............: 100.00% ✓ 5783      ✗ 0    
     ✓ { phase:rampdown }...........: 100.00% ✓ 2092      ✗ 0    
     ✓ { phase:warmup }.............: 100.00% ✓ 3255      ✗ 0    
     data_received..................: 499 MB  818 kB/s
     data_sent......................: 4.5 MB  7.4 kB/s
     http_req_blocked...............: avg=19.68µs min=1.81µs   med=6.69µs  max=22.6ms   p(90)=13.08µs p(95)=16.23µs  p(99)=336.06µs
     http_req_connecting............: avg=8.95µs  min=0s       med=0s      max=22.43ms  p(90)=0s      p(95)=0s       p(99)=218.57µs
     http_req_duration..............: avg=6.14s   min=2.14ms   med=5.58s   max=38.39s   p(90)=11.65s  p(95)=13.89s   p(99)=20s     
       { expected_response:true }...: avg=6.14s   min=2.14ms   med=5.58s   max=38.39s   p(90)=11.65s  p(95)=13.89s   p(99)=20s     
     ✓ { feature:auth }.............: avg=2.88s   min=37.71ms  med=1.98s   max=19.88s   p(90)=6.71s   p(95)=9.17s    p(99)=12.27s  
     ✓ { feature:board }............: avg=6.08s   min=2.46ms   med=5.96s   max=24.04s   p(90)=11.15s  p(95)=12.94s   p(99)=18.07s  
     ✓ { feature:chat }.............: avg=5.82s   min=2.84ms   med=5.27s   max=22.78s   p(90)=11.37s  p(95)=12.44s   p(99)=17.6s   
     ✓ { feature:comment }..........: avg=8.12s   min=2.2ms    med=7.29s   max=38.39s   p(90)=16.43s  p(95)=19.42s   p(99)=25.19s  
     ✓ { feature:friend }...........: avg=5.94s   min=2.67ms   med=5.94s   max=22.41s   p(90)=11.03s  p(95)=12s      p(99)=14.68s  
     ✓ { feature:hot }..............: avg=6s      min=9.29ms   med=5.38s   max=24.72s   p(90)=11.07s  p(95)=12.63s   p(99)=19.41s  
     ✓ { feature:mypage }...........: avg=5.57s   min=23.16ms  med=5.11s   max=17.25s   p(90)=10.62s  p(95)=12.13s   p(99)=15.52s  
     ✓ { feature:notification }.....: avg=6.28s   min=6.45ms   med=5.97s   max=21.12s   p(90)=11.43s  p(95)=12.99s   p(99)=18.1s   
     ✓ { feature:post }.............: avg=5.62s   min=2.14ms   med=5.09s   max=25.14s   p(90)=10.56s  p(95)=12.18s   p(99)=18.13s  
     ✓ { feature:reaction }.........: avg=6s      min=15.51ms  med=5.81s   max=21.9s    p(90)=10.17s  p(95)=12.03s   p(99)=17.38s  
     ✓ { feature:school }...........: avg=6.83s   min=5.1ms    med=6.42s   max=18.16s   p(90)=12.04s  p(95)=14.33s   p(99)=18.11s  
     ✓ { feature:scrap }............: avg=5.63s   min=25.35ms  med=5.22s   max=19.63s   p(90)=10.84s  p(95)=13.73s   p(99)=18.26s  
     ✓ { feature:timetable }........: avg=6.29s   min=21.25ms  med=5.92s   max=13.99s   p(90)=11.14s  p(95)=12.21s   p(99)=13.5s   
     ✓ { op:auth }..................: avg=2.88s   min=37.71ms  med=1.98s   max=19.88s   p(90)=6.71s   p(95)=9.17s    p(99)=12.27s  
     ✗ { op:read,phase:measure }....: avg=8.17s   min=3.45ms   med=7.58s   max=32.89s   p(90)=12.97s  p(95)=17.07s   p(99)=21.41s  
     ✗ { op:write,phase:measure }...: avg=8.45s   min=173.39ms med=7.9s    max=31.45s   p(90)=13s     p(95)=17.39s   p(99)=21.81s  
     ✓ { page:0 }...................: avg=4.22s   min=2.31ms   med=3.37s   max=19.73s   p(90)=9.01s   p(95)=10.45s   p(99)=13.87s  
     ✓ { page:1 }...................: avg=4.31s   min=2.35ms   med=3.61s   max=21.34s   p(90)=9.47s   p(95)=10.76s   p(99)=18.44s  
     ✓ { page:2 }...................: avg=4.16s   min=2.14ms   med=3.37s   max=21.3s    p(90)=8.81s   p(95)=10.84s   p(99)=19.36s  
     ✓ { page:3 }...................: avg=4.46s   min=5.63ms   med=4s      max=18.22s   p(90)=8.83s   p(95)=9.43s    p(99)=14.54s  
     ✓ { page:4 }...................: avg=3.45s   min=5.13ms   med=2.46s   max=18.49s   p(90)=7.67s   p(95)=9.92s    p(99)=13.97s  
     ✓ { phase:measure }............: avg=8.19s   min=3.45ms   med=7.6s    max=32.89s   p(90)=12.97s  p(95)=17.09s   p(99)=21.51s  
     ✓ { phase:rampdown }...........: avg=4.83s   min=2.14ms   med=4.39s   max=23.01s   p(90)=9.53s   p(95)=10.45s   p(99)=16.57s  
     ✓ { phase:warmup }.............: avg=3.39s   min=4.53ms   med=2.07s   max=38.39s   p(90)=8.64s   p(95)=11.49s   p(99)=16.04s  
     http_req_failed................: 0.00%   ✓ 0         ✗ 11012
     ✓ { phase:measure }............: 0.00%   ✓ 0         ✗ 5743 
     ✓ { phase:rampdown }...........: 0.00%   ✓ 0         ✗ 1913 
     ✓ { phase:warmup }.............: 0.00%   ✓ 0         ✗ 3356 
     http_req_receiving.............: avg=2.01ms  min=18.38µs  med=317.1µs max=210.59ms p(90)=1.04ms  p(95)=3.76ms   p(99)=70ms    
     http_req_sending...............: avg=51.2µs  min=6.25µs   med=35.89µs max=7.69ms   p(90)=97.13µs p(95)=111.46µs p(99)=182.31µs
     http_req_tls_handshaking.......: avg=0s      min=0s       med=0s      max=0s       p(90)=0s      p(95)=0s       p(99)=0s      
     http_req_waiting...............: avg=6.14s   min=2ms      med=5.58s   max=38.3s    p(90)=11.65s  p(95)=13.89s   p(99)=19.97s  
     http_reqs......................: 11012   18.059198/s
     ✓ { feature:auth }.............: 265     0.434588/s
     ✓ { feature:board }............: 1040    1.705554/s
     ✓ { feature:chat }.............: 868     1.423482/s
     ✓ { feature:comment }..........: 1965    3.222514/s
     ✓ { feature:friend }...........: 182     0.298472/s
     ✓ { feature:hot }..............: 1040    1.705554/s
     ✓ { feature:mypage }...........: 144     0.236154/s
     ✓ { feature:notification }.....: 376     0.616624/s
     ✓ { feature:post }.............: 4737    7.768472/s
     ✓ { feature:reaction }.........: 207     0.339471/s
     ✓ { feature:school }...........: 73      0.119717/s
     ✓ { feature:scrap }............: 52      0.085278/s
     ✓ { feature:timetable }........: 63      0.103317/s
     ✓ { op:auth }..................: 265     0.434588/s
     ✓ { op:read }..................: 9978    16.363483/s
     ✓ { op:write }.................: 769     1.261126/s
     ✓ { page:0 }...................: 555     0.910176/s
     ✓ { page:1 }...................: 219     0.35915/s
     ✓ { page:2 }...................: 122     0.200075/s
     ✓ { page:3 }...................: 86      0.141036/s
     ✓ { page:4 }...................: 57      0.093478/s
     ✓ { phase:measure }............: 5743    9.418268/s
     ✓ { phase:rampdown }...........: 1913    3.137236/s
     ✓ { phase:warmup }.............: 3356    5.503693/s
     iteration_duration.............: avg=36.98s  min=1.14s    med=27.49s  max=2m13s    p(90)=1m23s   p(95)=1m34s    p(99)=1m53s   
     iterations.....................: 2470    4.050692/s
     ✓ { phase:measure }............: 0       0/s
     ✓ { phase:rampdown }...........: 0       0/s
     ✓ { phase:warmup }.............: 0       0/s
     phase_iterations...............: 2470    4.050692/s
     ✓ { phase:measure }............: 1280    2.099144/s
     ✓ { phase:rampdown }...........: 525     0.860977/s
     ✓ { phase:warmup }.............: 665     1.090571/s
     vus............................: 1       min=0       max=200
     vus_max........................: 200     min=200     max=200
     ws_connecting..................: avg=4.72s   min=3.33ms   med=4.09s   max=18.91s   p(90)=9.52s   p(95)=11.79s   p(99)=17.04s  
     ws_msgs_received...............: 676     1.10861/s
     ws_msgs_sent...................: 930     1.525159/s
     ws_session_duration............: avg=27.63s  min=16.14s   med=26.62s  max=41.59s   p(90)=34.31s  p(95)=36.57s   p(99)=40.28s  
     ws_sessions....................: 118     0.193515/s